Tekla Open API Reference for Tekla Structures 2025
ReinforcementStrand.Attributes Property
 The attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementStrandAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementStrandAttributes Attributes { get; set; }
Public Property Attributes As ReinforcementBase.ReinforcementStrandAttributes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementStrandAttributes
See Also
Reference
ReinforcementStrand Class
Tekla.Structures.Drawing Namespace